{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 1],
              "dtype": "string",
              "sparse": false,
              "name": "aktivitas"
            },
            "name": "aktivitas",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 1],
              "dtype": "string",
              "sparse": false,
              "name": "tipe_destinasi"
            },
            "name": "tipe_destinasi",
            "inbound_nodes": []
          },
          {
            "class_name": "TextVectorization",
            "config": {
              "name": "text_vectorization",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "max_tokens": null,
              "standardize": "lower_and_strip_punctuation",
              "split": "whitespace",
              "ngrams": null,
              "output_mode": "int",
              "output_sequence_length": 10,
              "pad_to_max_tokens": false,
              "sparse": false,
              "ragged": false,
              "vocabulary": null,
              "idf_weights": null,
              "encoding": "utf-8",
              "vocabulary_size": 10
            },
            "name": "text_vectorization",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 1],
                      "dtype": "string",
                      "keras_history": ["aktivitas", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "TextVectorization",
            "config": {
              "name": "text_vectorization_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "max_tokens": null,
              "standardize": "lower_and_strip_punctuation",
              "split": "whitespace",
              "ngrams": null,
              "output_mode": "int",
              "output_sequence_length": 10,
              "pad_to_max_tokens": false,
              "sparse": false,
              "ragged": false,
              "vocabulary": null,
              "idf_weights": null,
              "encoding": "utf-8",
              "vocabulary_size": 98
            },
            "name": "text_vectorization_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 1],
                      "dtype": "string",
                      "keras_history": ["tipe_destinasi", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "input_dim": 10,
              "output_dim": 32,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": { "seed": null, "minval": -0.05, "maxval": 0.05 },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false
            },
            "name": "embedding",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 10],
                      "dtype": "int64",
                      "keras_history": ["text_vectorization", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "input_dim": 98,
              "output_dim": 32,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": { "seed": null, "minval": -0.05, "maxval": 0.05 },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false
            },
            "name": "embedding_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 10],
                      "dtype": "int64",
                      "keras_history": ["text_vectorization_1", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling1d",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 10, 32],
                      "dtype": "float32",
                      "keras_history": ["embedding", 0, 0]
                    }
                  }
                ],
                "kwargs": { "mask": null }
              }
            ]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling1d_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 10, 32],
                      "dtype": "float32",
                      "keras_history": ["embedding_1", 0, 0]
                    }
                  }
                ],
                "kwargs": { "mask": null }
              }
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axis": -1
            },
            "name": "concatenate",
            "inbound_nodes": [
              {
                "args": [
                  [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 32],
                        "dtype": "float32",
                        "keras_history": ["global_average_pooling1d", 0, 0]
                      }
                    },
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 32],
                        "dtype": "float32",
                        "keras_history": ["global_average_pooling1d_1", 0, 0]
                      }
                    }
                  ]
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 64],
                      "dtype": "float32",
                      "keras_history": ["concatenate", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 64],
                      "dtype": "float32",
                      "keras_history": ["dense", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 32],
                      "dtype": "float32",
                      "keras_history": ["dense_1", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          }
        ],
        "input_layers": [
          ["aktivitas", 0, 0],
          ["tipe_destinasi", 0, 0]
        ],
        "output_layers": [["dense_2", 0, 0]]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "loss_weights": null,
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense/kernel", "shape": [64, 64], "dtype": "float32" },
        { "name": "dense/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [64, 32], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [32, 1], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [1], "dtype": "float32" },
        {
          "name": "embedding/embeddings",
          "shape": [10, 32],
          "dtype": "float32"
        },
        {
          "name": "embedding_1/embeddings",
          "shape": [98, 32],
          "dtype": "float32"
        }
      ]
    }
  ]
}
